# Задача 22: 
# Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений, в порядке возрастания, все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. 
# n — кол-во элементов первого множества. 
# m — кол-во элементов второго множества. 
# Элементы множеств вводятся через random.

# import random
# n = int(input('Введите количество элементов первого множества: '))
# m = int(input('Введите количество элементов второго множества: '))
# i = 0
# list_1 = []
# while n > i:
#     list_1.append(random.randint(0,10))
#     i += 1
# print(list_1)
# list_1 = set(list_1)
# j = 0
# list_2 = []
# while m > j:
#     list_2.append(random.randint(0,10))
#     j += 1
# print(list_2)
# list_2 = set(list_2)

# x = list_1.intersection(list_2)
# print(x)

# Задача 24: 
# В фермерском хозяйстве в Карелии выращивают чернику. 
# Она растёт на круглой грядке, причём кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло 
# различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, 
# которое может собрать за один заход собирающий модуль, 
# находясь перед некоторым кустом заданной во входном файле грядки.

# import random
# n = int(input('Введите количество кустов: '))
# numb = int(input('Введите номер куста, на котором находится модуль для сбора: '))
# i = 0
# list_1 = []
# while n > i:
#     list_1.append(random.randint(1,10))
#     i += 1
# print(list_1)

# numb = numb - 1 #чтобы понятнее: номер куста, а не элемента.
# sum = 0
# if numb == 0:
#     sum = list_1[0] + list_1[numb + 1] + list_1[len(list_1) - 1]
# elif numb == len(list_1) - 1:
#     sum = list_1[numb] + list_1[len(list_1) - 2] + list_1[0]
# else:
#     sum = list_1[numb - 1] + list_1[numb] + list_1[numb + 1]
# print(f'Максимальное количество ягод с {sum} ближайших кустов можно собрать.')