# Задача 10: 
# На столе лежат n монеток. 
# Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, 
# чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть

# from random import randint
# n = int(input('Введите количество монет: '))

# orel = 0
# reshka = 0
# while n > 0:
#     a = randint(0,1)
#     print(a, end=' ')
#     if a == 0:
#         reshka += 1
#     else:
#         orel += 1
#     n -= 1
# if orel < reshka:
#     print(f'\nМинимальное количество монет, которые нужно перевернуть: {orel} - (это герб).')
# else:
#     print(f'\nМинимальное количество монет, которые нужно перевернуть: {reshka} - (это решка).')




# Задача 12: 
# Петя и Катя – брат и сестра. 
# Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), 
# а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. 
# Помогите Кате отгадать задуманные Петей числа.



# s = int(input('Сумма чисел X и Y: '))
# p = int(input('Произведение чисел X и Y: '))

# for x in range (s): 
#     for y in range (p):
#         if s == (x + y) and p == (x * y):
#             print(x,y)
 


# Задача 14: 
# Требуется вывести все целые степени двойки (т.е. числа вида 2k), 
# не превосходящие числа N.

# n = int(input('Введите число: '))

# k = 1

# while k < n:
#     print(k, end=" ")
#     k *= 2