
# Задача 26: 
# Напишите программу, которая на вход принимает
# два числа A и B, и возводит число А в целую степень B 
# с помощью рекурсии.

# A = 3; B = 5 -> 243 (3⁵)
# A = 2; B = 3 -> 8

# def Step(A,B):
#     if B == 1:
#         return A
#     if B!=1:
#         return (A*Step(A,B-1))
# print(Step(int(input('Введите число А: ')), int(input('Введите число В: '))))

# Задача 28: 
# Напишите рекурсивную функцию sum(a, b),
# возвращающую сумму двух целых неотрицательных чисел. 
# Из всех арифметических операций допускаются только +1 и -1.
# Также нельзя использовать циклы.

# 2 2
# 4

# def Sum(a,b):
#     if b == 1:
#         return a + 1
#     if b != 1:
#         return Sum(a + 1,b - 1)
# print(Sum(int(input('Введите число А: ')), int(input('Введите число В: '))))