# По данному целому неотрицательному n вычислите значение n!. 
# N! = 1 * 2 * 3 * … * N (произведение всех чисел от 1 до N) 0! = 1 
# Решить задачу используя цикл while

# my_limit = int(input('Введите максимальное число фактариал: '))

# fact = 1
# count = 1
# while count<= my_limit:
#     fact *= count
#     count += 1
# print(fact)    

# Задача 11
# Дано натуральное число A > 1. 
# Определите, каким по счету числом Фибоначчи оно является, то есть выведите такое число n, что φ(n)=A. 
# Если А не является числом Фибоначчи, выведите число -1.


# n1 = 0
# n2 = 1
# i = 1   

# num = int(input('Введите предполагаемое число Фибоначчи: '))

# while n2 < num:
#     n1, n2 = n2, n2 + n1
#     i += 1

# if n2 == num:
#     print(i)
# else:
#     print(-1)
# тернальный оператор:
# print(i if n2 == num else -1) 




# Уставшие от необычно теплой зимы, жители решили узнать, 
# действительно ли это самая длинная оттепель за всю историю наблюдений за погодой. 
# Они обратились к синоптикам, а те, в свою очередь, занялись исследованиями статистики за прошлые годы. 
# Их интересует, сколько дней длилась самая длинная оттепель. Оттепелью они называют период, 
# в который среднесуточная температура ежедневно превышала 0 градусов Цельсия. 
# Напишите программу, помогающую синоптикам в работе.


# import random

# legth = 30
# count = 0
# max_count = 0
# today = 0

# for i in range(legth):
#     today += random.randint(-3, 3)
#     print(today, end=" ")
#     if today > 0:
#         count += 1
#         if count > max_count:
#             max_count = count
#     else:
#         count = 0
# print(f'\nМаксимальное количество тёплых дней: {max_count}')
    



# Иван Васильевич пришел на рынок и решил купить два арбуза: один для себя, 
# а другой для тещи. Понятно, что для себя нужно выбрать арбуз потяжелей, 
# а для тещи полегче. Но вот незадача: арбузов слишком много и он не знает как же выбрать самый легкий и самый тяжелый арбуз? 
# Помогите ему!
# Пользователь вводит одно число N – количество арбузов. Вторая строка содержит N чисел, 
# записанных на новой строчке каждое. Здесь каждое число – это масса соответствующего арбуза. 
# Все числа натуральные и не превышают 30000.

# import random

# MAX_WEIGTH = 3000
# MIN_WEIGTH = 1000

# watermelon = int(input('Введите количество арбузов: '))

# weigth = 0
# min_weigth = MAX_WEIGTH
# max_weigth = MIN_WEIGTH

# for i in range(watermelon):s
#     weigth = random.randint(MIN_WEIGTH, MAX_WEIGTH)
#     print(weigth, end=' ')
#     if weigth > max_weigth:
#         max_weigth = weigth
#     if weigth < min_weigth:
#         min_weigth = weigth
# print(f'\nАрбуз для себя: {min_weigth} гр., а арбуз для тёщи: {max_weigth} гр.')
