# За день машина проезжает n километров. 
# Сколько дней нужно, чтобы проехать маршрут длиной m километров? 
# При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.

# import math  использование математической библиотеки 

# n = int(input('Bведите количество километров за день: '))
# m = int(input('Bведите необходимой расстояние: '))

# d = ((m + n - 1) // n)


# d = math.ceil(m/n)   округляет в большую сторону


# print(f'машина проедет {m} километров за {d} дней')


# В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для них новыми партами. 
# За каждой партой может сидеть два учащихся. Известно количество учащихся в каждом из трех классов. 
# Выведите наименьшее число парт, которое нужно приобрести для них.


# c1 = int(input('введите количество учеников в 1 классе: '))
# c2 = int(input('введите количество учеников в 2 классе: '))
# c3 = int(input('введите количество учеников в 3 классе: '))

# p1 = c1 // 2 + c1 % 2
# p2 = c2 // 2 + c2 % 2
# p3 = c3 // 2 + c3 % 2

# Второй способ: сделанный в зале, но не правильный!!!

# p1 = (c1 + 1 // 2)
# p2 = (c2 + 1 // 2)
# p3 = (c3 + 1 // 2)


# print(f"для трёх классов с количеством учеников: {c1}, {c2}, {c3} - нужно {p1+p2+p3} парты.")



# Вагоны в электричке пронумерованы натуральными числами, 
# начиная с 1 (при этом иногда вагоны нумеруются от «головы» поезда, 
# а иногда – с «хвоста»; это зависит от того, в какую сторону едет электричка). 
# В каждом вагоне написан его номер. Витя сел в i-й вагон от головы поезда и обнаружил, 
# что его вагон имеет номер j. Он хочет определить, сколько всего вагонов в электричке. 
# Напишите программу, которая будет это делать или сообщать, что без дополнительной информации это сделать невозможно.


# i = int(input('В какой вагон сел Витя?: '))
# j = int(input('Номер Витиного вагона по нумерации поезда: '))
# if i != j:
#     n = (i + j - 1)
#     print(f"{n} - количество вагонов в поезде.")
# else:
#     print("Недостаточное условие задачи!:")    


# Дано натуральное число. Требуется определить, является ли год с данным номером високосным. 
# Если год является високосным, то выведите YES, иначе выведите NO. 
# Напомним, что в соответствии с григорианским календарем, год является високосным, 
# если его номер кратен 4, но не кратен 100, а также если он кратен 400.


# n = int(input('введите год: '))
# if (n % 4 != 0 and n % 400 != 0) or n % 100 == 0:
#     print('"no" - не высокосный ')
# else:
#     print('"yes" - высокосный')

