# Дан список чисел. Определите, сколько в нем встречается различных чисел.

# Task 1
# Дан список чисел. Определите, сколько в нем встречается различных чисел.
# var 01
# list_num = list(input('Введите числа: '))
# uniq_list = []

# for item in list_num:
#     if not item in uniq_list:
#         uniq_list.append(item)

# print(list_num)
# print(uniq_list)
# print(len(uniq_list))

# var 02
# list_num = list(input('Введите числа: '))

# print(list_num)
# print(len(set(list_num)))

# var 03
# print(set_num := input('Введите список чисел: '), len(set(set_num)))
# dop
# num = 5
# set_num = {1, 2, 3, 4, 5, 6}

# print(num in set_num)
#   Дана последовательность из N целых чисел и число K. 
# Необходимо сдвинуть всю последовательность (сдвиг - циклический) на K элементов вправо, K – положительное число.



# Дан список, состоящий из целых чисел. 
# Напишите программу, которая подсчитает количество элементов списка, 
# больших предыдущего (элемента с предыдущим номером)


my_list = [{"V": "S001"}, {"V": "S002"},
           {"VI": "S001"}, {"VI": "S005"},
           {"VII": "S005"}, {" V ": "S009"},
           {" VIII ": "S007"}]